[
  {
    "img": "/ShreyasBora.jpg",
    "name": "Shreyas Bora",
    "address": "Travel Agent",
    "testimonial": "I recently had the pleasure of having Abhishek Singh Rajput from Altersppace Solutions came to inspect my under-construction house in Ahmednagar, I asked him for specifics regarding System Windows installation, and he provided me with flawless samples & solutions of every product he sold. His recommendations were spot-on. The biggest satisfaction came from begin guided as a friend rather than a customer. I'm excited to work with you and have your product installed at my house. I've already recommended you to my friends and relatives who are in the process of building new homes."
  },
  {
    "img": "/JayRajMachale.jpg",
    "name": "Jay Raj Machale",
    "address": "Building Materials",
    "testimonial": "I had a fantastic 1-2-1 meeting with Abhishek Sir. He provided valuable insights and practical advice that I can directly apply to my business. Our conversation was both engaging and productive, and I look forward to future collaborations. Highly recommended to all for his services."
  },
  {
    "img": "/SrikanthKomanduri.jpg",
    "name": "Srikanth Komanduri",
    "address": "Commercial Loans",
    "testimonial": "Dear Abhishek, I want to take a moment to share my positive experience with Abhishek Singh Rajput and ALTERSPPACE SOLUTIONS. As a member of our Windows & Doors category, ALTERSPPACE SOLUTIONS stands out for their exceptional custom solutions and professional installation services. I recently had the pleasure of working with Abhishek and his team on a project involving Aluminium Windows and UPVC Windows. Their attention to detail and dedication to customer satisfaction were evident from the initial consultation to the final installation. The team was not only professional but also incredibly knowledgeable about their products and the best practices for installation. What impressed me most was their ability to provide tailored solutions that perfectly met our requirements. Whether it was the Toughened Glass Doors & Partitions or the Sliding Doors & Partitions, each product was of the highest quality and installed with precision. Abhishek's commitment to ensuring complete satisfaction was unwavering, and it truly made a difference. If you are looking for top-notch windows and doors solutions, I highly recommend ALTERSPPACE SOLUTIONS. Abhishek Singh Rajput and his team are dedicated to delivering excellence in every aspect of their work. Thank you, Abhishek, for your outstanding service and support."
  },
  {
    "img": "/SanketKasat.jpg",
    "name": "Sanket Kasat",
    "address": "Construction",
    "testimonial": "ONE-STOP SOLUTION FOR GLASS & WINDOW WORKS We, Agile Ventures, are into Water and Waste Water Management. As we are relocating to our office located at Katraj-Kondhwa Road near ISKCON Temple, we were looking for an office glass partition contractor for past 2 months but we were not satisfied with the rate and technical knowledge presented by some of the good vendors in our sphere. We came across Abhishek Singh Rajput. when he displayed his completed work at Mirch Masala Hotel. We have immediately done the site visit and checked his quality of work to which we were really satisfied and made up our mind of going ahead with him. After the site visit, we have also visited his office cum display showroom at Sinhgad Road and I was really impressed with the kind of variety of products he has displayed over there. The way he has explained differences between his deliverables and others, 1 understood his acumen and expertise in his vertical. We hardly find vendors like Abhishek who works passionately to delivery quality without compromising on price Abhishek, no doubt, anyone who gets associated with you once, would be in touch forever! Keep up the good work buddy! Looking forward to get associated with you for more services. Regards, For Agile Ventures Sanket Kasat COO/Partner"
  }
]
